Revit 2027 API
StructuralSectionLAngle.BoltDiameterLongerFlange Property
 Maximum bolt hole diameter in the longer flange, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BoltDiameterLongerFlange { get; set; }
Public Property BoltDiameterLongerFlange As Double
	Get
	Set
public:
property double BoltDiameterLongerFlange {
	double get ();
	void set (double value);
}
member BoltDiameterLongerFlange : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace